<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="1" name="args_0" type="Parameter" version="opset1">
			<data shape="1,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="args_1" type="Parameter" version="opset1">
			<data shape="1,128,16,1" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 4, 7" offset="0" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 4, 16" offset="224" size="3584" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 4, 16" offset="3808" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 4, 16" offset="12000" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_4_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="20192" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 7" offset="24288" size="1792" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_6_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 2, 1" offset="26080" size="112" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_741" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="26192" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model/ttl/sequential/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model/ttl_9/sequential_9/flatten_9/Const" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="26196" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model/ttl_9/sequential_9/flatten_9/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model/ttl_9/sequential_9/tt_dense_9/t3f_matmul/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26204" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/ttl_9/sequential_9/tt_dense_9/t3f_matmul/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1024</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_1/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26216" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2048</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_1/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_2/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26228" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>2048</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_2/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_3/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26240" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_3/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_4/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26240" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_4/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_5/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26240" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_5/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_6/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26252" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_6/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/ttl/sequential/reshape/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="26264" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/ttl/sequential/reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Transpose_5215_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 3" offset="26276" size="180" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_5215" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model/softmax_embedding_layer/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_5403_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="26456" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_5403" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model/softmax_embedding_layer/dense/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model/softmax_embedding_layer/dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Transpose_5218_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="26516" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Transpose_5218" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model/softmax_embedding_layer/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_5404_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="28316" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_5404" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model/softmax_embedding_layer/dense_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/softmax_embedding_layer/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_5221_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="28376" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_5221" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/softmax_embedding_layer/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_5405_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="30176" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_5405" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model/softmax_embedding_layer/dense_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model/softmax_embedding_layer/dense_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Transpose_5224_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="30236" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Transpose_5224" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/softmax_embedding_layer/dense_3/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_5406_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="32036" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_5406" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/softmax_embedding_layer/dense_3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/softmax_embedding_layer/dense_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Transpose_5227_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="32096" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transpose_5227" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/softmax_embedding_layer/dense_4/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_5407_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="33896" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_5407" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model/softmax_embedding_layer/dense_4/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model/softmax_embedding_layer/dense_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transpose_5230_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="33956" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Transpose_5230" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/softmax_embedding_layer/dense_5/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_5408_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="35756" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_5408" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model/softmax_embedding_layer/dense_5/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/softmax_embedding_layer/dense_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Transpose_5233_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="35816" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Transpose_5233" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/softmax_embedding_layer/dense_6/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_5409_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="37616" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_5409" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model/softmax_embedding_layer/dense_6/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/softmax_embedding_layer/dense_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transpose_5236_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="37676" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transpose_5236" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model/softmax_embedding_layer/dense_7/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_5410_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="39476" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_5410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model/softmax_embedding_layer/dense_7/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model/softmax_embedding_layer/dense_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Transpose_5239_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="10, 30" offset="39536" size="600" />
			<output>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Transpose_5239" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model/softmax_embedding_layer/dense_8/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_5411_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 10" offset="40136" size="20" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_5411" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="model/softmax_embedding_layer/dense_8/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model/softmax_embedding_layer/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model/tf.__operators__.getitem/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="40156" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model/tf.__operators__.getitem/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="40156" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model/tf.__operators__.getitem/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="40172" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model/tf.__operators__.getitem/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0, 0, 1" end_mask="1, 0, 0, 1" new_axis_mask="0, 1, 1, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="model/tf.__operators__.getitem_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="40188" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="model/tf.__operators__.getitem_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="40196" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model/tf.__operators__.getitem_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="40204" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model/tf.__operators__.getitem_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0, 0" end_mask="0, 0" new_axis_mask="0, 0" shrink_axis_mask="0, 1" ellipsis_mask="1, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="model/multiply/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="model/ttl_1/sequential_1/tt_dense_1/t3f_matmul/t3f_transpose/transpose_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 4, 7" offset="40212" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="model/ttl_1/sequential_1/tt_dense_1/t3f_matmul/t3f_transpose/transpose" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="model/ttl_1/sequential_1/tt_dense_1/t3f_matmul/t3f_transpose/transpose_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 4, 16" offset="40436" size="3584" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="model/ttl_1/sequential_1/tt_dense_1/t3f_matmul/t3f_transpose/transpose_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>4</dim>
