<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="1" name="args_0" type="Parameter" version="opset1">
			<data shape="1,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="args_1" type="Parameter" version="opset1">
			<data shape="1,128,16,1" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 2, 7" offset="0" size="112" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 2, 16" offset="112" size="1792" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="1904" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="6000" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_4_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="10096" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 7" offset="14192" size="1792" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_6_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 2, 1" offset="15984" size="112" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/ttl/sequential/tt_dense_0/t3f_matmul/t3f_transpose/transpose_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_1404" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="16096" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model/ttl/sequential/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model/ttl/sequential/einsum_ttl/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16100" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model/ttl/sequential/einsum_ttl/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16112" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model/ttl/sequential/einsum_ttl/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16124" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/ttl/sequential/einsum_ttl/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1" end_mask="1, 0, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model/ttl/sequential/einsum_ttl/strided_slice_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="16136" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model/ttl/sequential/einsum_ttl/strided_slice_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model/ttl/sequential/einsum_ttl/einsum/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model/ttl/sequential/einsum_ttl/strided_slice_2/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16152" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model/ttl/sequential/einsum_ttl/strided_slice_2/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16164" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/ttl/sequential/einsum_ttl/strided_slice_2/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16124" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/ttl/sequential/einsum_ttl/strided_slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1" end_mask="1, 0" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Unsqueeze_1424_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="16136" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Unsqueeze_1424" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Broadcast_1431" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="16176" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="ReverseSequence_1434" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_1435" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="16180" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model/ttl/sequential/einsum_ttl/ReverseV2" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model/ttl/sequential/einsum_ttl/einsum_1/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model/ttl/sequential/einsum_ttl/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/ttl/sequential/einsum_ttl/strided_slice_4/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16184" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/ttl/sequential/einsum_ttl/strided_slice_4/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16152" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model/ttl/sequential/einsum_ttl/strided_slice_4/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16124" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model/ttl/sequential/einsum_ttl/strided_slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0, 1" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/ttl/sequential/einsum_ttl/strided_slice_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="16196" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/ttl/sequential/einsum_ttl/strided_slice_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/ttl/sequential/einsum_ttl/einsum_2/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model/ttl/sequential/einsum_ttl/strided_slice_6/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16112" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model/ttl/sequential/einsum_ttl/strided_slice_6/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16212" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model/ttl/sequential/einsum_ttl/strided_slice_6/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16124" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model/ttl/sequential/einsum_ttl/strided_slice_6" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 1" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Unsqueeze_1388_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="16196" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Unsqueeze_1388" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Broadcast_1395" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="16176" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ReverseSequence_1398" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_1399" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="16180" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model/ttl/sequential/einsum_ttl/ReverseV2_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model/ttl/sequential/einsum_ttl/einsum_3/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model/ttl/sequential/einsum_ttl/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/ttl/sequential/einsum_ttl/concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/ttl/sequential/flatten/Const" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="16224" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model/ttl/sequential/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16232" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_1/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16244" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>64</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_1/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_2/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16256" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_2/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>256</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_3/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16256" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>256</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_3/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_4/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16256" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1024</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_4/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_5/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16256" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2048</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_5/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>2048</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_6/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16244" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model/ttl/sequential/tt_dense_0/t3f_matmul/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>2048</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4096</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model/ttl/sequential/tt_dense_0/t3f_matmul/einsum_6/Einsum" type="Einsum" version="opset7">
			<data equation="aijb,rjb->ira" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/ttl/sequential/reshape/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="16268" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="model/ttl/sequential/reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4096</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transpose_9683_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 3" offset="16280" size="180" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Transpose_9683" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/softmax_embedding_layer/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_10089_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="16460" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_10089" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/softmax_embedding_layer/dense/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model/softmax_embedding_layer/dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose_9686_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="16520" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Transpose_9686" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/softmax_embedding_layer/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_10090_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="18320" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_10090" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model/softmax_embedding_layer/dense_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model/softmax_embedding_layer/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Transpose_9689_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="18380" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Transpose_9689" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model/softmax_embedding_layer/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_10091_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="20180" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_10091" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model/softmax_embedding_layer/dense_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model/softmax_embedding_layer/dense_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Transpose_9692_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="20240" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Transpose_9692" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model/softmax_embedding_layer/dense_3/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_10092_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="22040" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_10092" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model/softmax_embedding_layer/dense_3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model/softmax_embedding_layer/dense_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Transpose_9695_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="22100" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Transpose_9695" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model/softmax_embedding_layer/dense_4/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_10093_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 30" offset="23900" size="60" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_10093" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="model/softmax_embedding_layer/dense_4/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="model/softmax_embedding_layer/dense_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Transpose_9698_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30, 30" offset="23960" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Transpose_9698" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="model/softmax_embedding_layer/dense_5/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
