<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="1" name="args_0" type="Parameter" version="opset1">
			<data shape="1,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="args_1" type="Parameter" version="opset1">
			<data shape="1,128,16,1" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="args_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 4, 16" offset="0" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 4, 16" offset="512" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="8704" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="12800" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_4_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 16" offset="16896" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 4, 2, 7" offset="20992" size="1792" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_6_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7, 4, 2, 1" offset="22784" size="112" />
			<output>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_1/ttl_10/sequential_10/tt_dense_10/t3f_matmul/t3f_transpose/transpose_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>7</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_3280" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22896" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model_1/ttl_10/sequential_10/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22900" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22912" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1" end_mask="1, 0, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="22936" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_2/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_2/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22964" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_2/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1" end_mask="1, 0" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Unsqueeze_3504_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="22976" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Unsqueeze_3504" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Broadcast_3511" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22992" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="ReverseSequence_3514" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_3515" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22996" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model_1/ttl_10/sequential_10/einsum_ttl_10/ReverseV2" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_1/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_1/ttl_10/sequential_10/einsum_ttl_10/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_4/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="23000" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_4/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_4/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0, 1" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="23012" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_2/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_6/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22912" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_6/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="23028" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_6/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_6" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 1" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Unsqueeze_3470_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="23040" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Unsqueeze_3470" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Broadcast_3477" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22992" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ReverseSequence_3480" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_3481" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22996" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model_1/ttl_10/sequential_10/einsum_ttl_10/ReverseV2_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_3/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model_1/ttl_10/sequential_10/einsum_ttl_10/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_8/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22900" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_8/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22912" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_8/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_8" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1" end_mask="1, 0, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_9_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="23056" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_9" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_4/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_10/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_10/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22964" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_10/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_10" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1" end_mask="1, 0" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Unsqueeze_3436_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="23072" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Unsqueeze_3436" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Broadcast_3443" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22992" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="ReverseSequence_3446" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_3447" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22996" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model_1/ttl_10/sequential_10/einsum_ttl_10/ReverseV2_2" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_5/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model_1/ttl_10/sequential_10/einsum_ttl_10/add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_12/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="23000" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_12/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_12/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_12" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0, 1" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_13_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="23088" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_13" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_6/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_14/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22912" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_14/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="23028" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_14/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 1" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Unsqueeze_3402_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="23104" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Unsqueeze_3402" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Broadcast_3409" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22992" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="ReverseSequence_3412" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_3413" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22996" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model_1/ttl_10/sequential_10/einsum_ttl_10/ReverseV2_3" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_7/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model_1/ttl_10/sequential_10/einsum_ttl_10/add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_16/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22900" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_16/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22912" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_16/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_16" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1" end_mask="1, 0, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_17_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="23120" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_17" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_8/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_18/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_18/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22964" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_18/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_18" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1" end_mask="1, 0" new_axis_mask="0, 0" shrink_axis_mask="0, 0" ellipsis_mask="0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Unsqueeze_3368_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8" offset="23136" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Unsqueeze_3368" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Broadcast_3375" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22992" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="ReverseSequence_3378" type="ReverseSequence" version="opset1">
			<data batch_axis="0" seq_axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_3379" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="22996" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="model_1/ttl_10/sequential_10/einsum_ttl_10/ReverseV2_4" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="model_1/ttl_10/sequential_10/einsum_ttl_10/einsum_9/Einsum" type="Einsum" version="opset7">
			<data equation="abc,c->ab" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model_1/ttl_10/sequential_10/einsum_ttl_10/add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_20/stack" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="23000" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_20/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22952" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_20/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="22924" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_20" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0, 1" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_21_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="23152" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="model_1/ttl_10/sequential_10/einsum_ttl_10/strided_slice_21" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
